# Задание: Методы в Page Object

# Изучите страницу каталога товаров в нашем интернет-магазине:
# http://selenium1py.pythonanywhere.com/catalogue/category/books_2/.

# Подумайте, какие методы могли бы быть реализованы в Page Object,
# ассоциированного с этой страницей?

# Обратите внимание, что нужно выбрать несколько вариантов.

# Бонусное задание: написать в комментарии еще какой-нибудь пример!

# перейти на страницу товара
# перейти на страницу логина
# проверить, что есть сообщение об успешном добавлении в корзину
# поменять язык интерфейса

# Bonus
# проверить доступность изображения на карточке товара
# проверить наличие изображения на карточке товара
# проверить корректность валюты по выбранному языку
# проверить изменение названий по выбранному языку
# проверить количество товаров в выдаче
# проверить работу поиска по названию
# проверить работу поиска при пустом запросе
# проверить наличие товара
# проверить отображение звездного рейтинга
# проверить отсутствие кнопки Добавить в корзину у отсутствующего товара
# проверить работу пагинации
# проверить работу ссылок в навбаре
# проверить работу дропдаун меню элементов
# проверить корректность отображения стоимости в корзине при добавлении товаров

