# ID-селекторы

# CSS-селекторы используют фронтенд-разработчики,
# чтобы выбрать элементы на странице и применить к ним определенные стили,
# то есть правила для отрисовки. В автотестах мы пишем селекторы по тем же самым правилам,
# чтобы найти нужные нам элементы и произвести с ними
# какие-то действия с помощью Selenium WebDriver.

# В этом уроке мы будем использовать CSS-файлы,
# чтобы потренироваться в подборе и написании селекторов.

# Ниже в интерактивной консоли вы найдете немного урезанную страницу
# с котами из предыдущих уроков.
# Попробуйте написать селектор, который найдет элемент с заголовком в карточке первого кота.
# Используйте для этого ID элемента.

# Вместо текста "ваш селектор здесь" в поле CSS напишите селектор:

# ваш селектор здесь
# {
#     color:blue;
# }

# Не редактируйте поле HTML,
# чтобы задание было засчитано, — вам нужно только изменить поле CSS.

# Если все сделано как надо, текст с названием карточки станет синим,
# а галочка в задании — зеленой.
# Не забудьте после этого отправить задание, чтобы получить баллы.

