# Задание: наследование и отрицательные проверки

# В файл test_main_page.py добавьте тест с названием

#  test_guest_cant_see_product_in_basket_opened_from_main_page:

# Гость открывает главную страницу
# Переходит в корзину по кнопке в шапке сайта
# Ожидаем, что в корзине нет товаров
# Ожидаем, что есть текст о том что корзина пуста
# В файле test_product_page.py добавьте тест с названием

# test_guest_cant_see_product_in_basket_opened_from_product_page:

# Гость открывает страницу товара
# Переходит в корзину по кнопке в шапке
# Ожидаем, что в корзине нет товаров
# Ожидаем, что есть текст о том что корзина пуста

# В классе BasePage реализуйте соответствующий метод для перехода в корзину.
# Создайте файл basket_page.py и в нем класс BasketPage.
# Реализуйте там необходимые проверки, в том числе отрицательную,
# которую мы обсуждали в предыдущих шагах.

# Убедитесь, что тесты проходят и зафиксируйте изменения в коммите.
