# Атрибуты, которые влияют на отображение элемента

# Сейчас же мы рассмотрим ту часть языка HTML, которaя позволит вам писать код для автотестов.

# Поговорим чуть подробнее про атрибуты элементов.
# Некоторые атрибуты влияют на отрисовку элемента на странице, а другие не влияют напрямую,
# но могут использоваться в JavaScript-коде или быть нужными только для локации элемента в тестах.

# Примеры атрибутов, которые повлияют на отображение и поведение элемента на странице:

# <h1 style="color: blue;"> Заголовок будет синим, т.к. цвет задан в атрибуте style </h1>
# <p hidden> Атрибут hidden скрывает элемент на странице, элемент не будет показываться </p>
# <button disabled> Кнопка с атрибутом disabled будет заблокирована </button>
# Чуть ниже вы найдете интерактивную консоль,
# попробуйте добавить вышеуказанные атрибуты элементам и посмотрите, как изменится отображение элементов.
# Не забудьте отправить решение кнопкой "Отправить" ("Submit"),
# после того как все пункты чек-листа будут отмечены как верные.


# <h1 style="color: blue;"> Этот заголовок будет синим </h1>
# <p hidden> Этот атрибут скрывает элемент на странице, элемент не будет показываться </p>
# <button disabled> Кнопка с атрибутом disabled будет заблокирована </button>
