# В этом курсе мы рекомендуем пользоваться CSS-селекторами для поиска элементов.
# Чтобы вы почувствовали себя увереннее в них, мы приготовили еще немного упражнений.
# Если не хватает теории, то можно вернуться к предыдущему уроку.

# Внимание! Некоторые из этих задач работают только в Chrome,
# так что рекомендуем проходить урок именно в этом браузере.
# Все из-за того, что Firefox и другие браузеры не поддерживают некоторые флаги
# регулярных выражений (см  RegExp.prototype.dotAll).
# https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/RegExp/dotAll

# Для дополнительной практики рекомендуем игру: CSS Diner (спасибо, Anton Savenko!).
# https://flukeout.github.io/

# Селектор с помощью ID элемента
# Селектор с атрибутом data-type
# Селектор класса
# Составной селектор из нескольких классов
# Составной селектор
# Иерархическая структура элементов