# Задание: подберите тег

# Какой тег используется для задания кнопки "Поиск в Google"
# (или "Google Search", если у вас англоязычный браузер) на сайте https://www.google.com/?

# Чтобы посмотреть, как описывается элемент в html-структуре любой веб-страницы:

# откройте веб-страницу в браузере
# нажмите правой кнопкой мыши на нужном элементе
# в контекстном меню выберите пункт меню "Inspect" (в русскоязычной версии браузера "Просмотреть код")
# Справа или внизу окна браузера откроется консоль разработчика на вкладке Elements.
# Выбранный элемент будет подсвечен.

# input
